<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link title="artikolo-stilo" type="text/css" rel="stylesheet" href="../stl/artikolo.css">
<title>Manlibro por vindozuloj inter la revuloj</title>
<style type="text/css"><!--
        blockquote { font-family: monospace; }
        table      { border: 1px solid; border-spacing: 1px; }
        th         { background-color: #999999; }
        .noto      { color: #333333; margin-left: 10%; }
  -->
</style>
</head>
<body>
<h1>Manlibro por vindozuloj inter la revuloj</h1>
<p>2003-10-27</p>
<p>
Tiu &#265;i dokumento klarigas, kiel redakti por Revo per vindoza
komputilo. &#264;io prezentata funkcias per Vindozo-2000.  
Povas esti, ke aliaj eldonoj de Vindozo donas iom malsimilajn 
kondi&#265;ojn.
</p>
<ul>
  <li><a href="#redaktanto">Fari&#285;u redaktanto</a></li>
  <li><a href="#programoj">Akiru utilajn programojn</a></li>
  <li><a href="#hejmigu">Hejmigu Revon</a></li>
  <li><a href="#redaktu">Redaktu</a></li>
  <li><a href="#sendu">Sendu viajn redakta&#309;ojn</a></li>
</ul>
<a name="redaktanto"></a>
<h2>1 - Fari&#285;u redaktanto</h2>
<p>
Kompreneble vi povas redakti por Revo per nura interreta foliumilo dum
konekto. Tio simplas, sed ne tre efikas.  &#264;i tie ni vidos, kiel vi 
povas labori el&#349;utante la enhavon de Revo al via komputilo, redaktante 
sen konekto, kaj poste sendante la redakta&#309;ojn per retpo&#349;to.
</p>
<p>
Por kontribui al Revo per iu ajn procedo, vi devas unue registri&#285;i 
kiel redaktanto.  Pri tio legu en la retejo de Revo sub 
<a href="redinfo.html">ktp.-&gt;redaktado-&gt;fari&#285;i redaktanto</a>.
</p>
<p>
Kiam via retpo&#349;ta nomo estos registrita, vi povos sendi redakta&#309;ojn.
</p>
<a name="programoj"></a>
<h2>2 - Akiru utilajn programojn</h2>
<p>
Pluraj senpagaj programoj helpos en la redaktado, nome:
</p>
<ul>
  <li>maldensigilo &#8211; kiel ekzemplon ni uzos &#265;i-sube Vinzipon (<em>Winzip</em>)</li>
  <li>redaktilo &#8211; kiel ekzemplon ni uzos Uniredon (<em>Unired</em>)</li>
  <li>komand-stila retpo&#349;tilo - kiel ekzemplon ni uzos Blaton (<em>blat</em>).</li>
</ul>
<p>
Nur la maldensigilo nepre necesas.  La ceterajn programojn povas
anstata&#365;i ordinaraj vindoza&#309;oj: anka&#365; <em>Notepad</em> 
estas redaktilo, kaj anka&#365; via kutima retpo&#349;ta programo
sendos la redakta&#309;ojn. Tamen la &#265;i tie proponataj programoj 
tre faciligos vian laboron.
</p>
<p class="noto">
Vinzipo fakte ne estas senpaga&#309;o, sed propaga&#309;o.  Tio
signifas, ke vi povas uzi &#285;in senpage, sed mesa&#285;eto
memorigos vin, ke estus lojale pagi al la venda kompanio.  
&#284;i estas baze anglalingva, kaj de &#285;i ekzistas nuntempe anka&#365; franca,
germana kaj japana eldonoj.
</p>
La instalo de Vinzipo kaj Uniredo similas al tiu de ajna vindoza
programo.  Ili a&#365;tomate lokas sin en la program-dosieron.  Blato venas 
kiel densa&#309;o, kiun vi malfermos per Vinzipo kaj metos en la &#285;ustan
dosierujon.  La agordon de la programoj ni vidos en la respektivaj
sekvaj &#265;apitroj.
</p>
<p>
resume:
</p>
<table>
  <tr>
  <th>speco</th>
  <th>nomo</th>
  <th>el&#349;utejo</th>
  <th>resuma trakto</th>
  </tr>
  <tr>
  <td>maldensigilo</td>
  <td>Winzip</td>
  <td><a href="http://www.winzip.com">http://www.winzip.com</a></td>
  <td>instalu la&#365; normala vindoza maniero</td>
  </tr>
  <tr>
  <td>redaktilo</td>
  <td>Unired</td>
  <td><a href="http://www.esperanto.mv.ru/UniRed/UTF8"
  >http://www.esperanto.mv.ru/UniRed/UTF8</a></td>
  <td>prenu la <em>distribua&#309;on</em> kaj la esperantan <em>asimilon</em>,
      instalu ilin sinsekve la&#365; normala vindoza maniero</td>
  </tr>
  <tr>
  <td>retpo&#349;tilo</td>
  <td>Blat</td>
  <td><a href="http://www.blat.net">http://www.blat.net</a></td>
  <td>prenu la version <em>lite</em>
      maldensigu la el&#349;uta&#309;on kaj &#349;ovu <code>blat.exe</code> al
      <code>c:\winnt\system32</code>
  </td>
  </tr>
</table>

<a name="hejmigu"></a>
<h2>3 - Hejmigu revon</h2>

<h3>El&#349;uto</h3>

<p>
Por labori sur via propra durdisko, vi devas unue &#349;uti al &#285;i la
enhavon de Revo.  Tuj post la el&#349;uto vi bezonos Vinzipon a&#365; alian
maldensigilon.  Do prefere unue akiru kaj instalu tiun programon.
Vinzipo bezonas neniun specialan agordon.
</p>
<p>
Per via foliumilo vizitu en la retejo de Revo la pa&#285;on 
<a href="../tgz/index.html">ktp.-&gt;gravaj pa&#285;oj-&gt;el&#349;uti</a>.  En
tiu pa&#285;o periode liveri&#285;as la tuta enhavo de Revo, kaj intertempaj
partaj &#285;isdatigoj.  Ekzemple en la du dosieroj
<code>revoxml_2003-09-14.tgz</code> kaj 
<code>revohtml_2003-09-14.tgz</code> estas tuta Revo
el 2003-09-14.  Kaj en <code>revonov_2003-09-10_2003-09-15.tgz</code>
estas &#265;iuj modifa&#309;oj faritaj inter 2003-09-10 kaj 2003-09-15.
</p>
<p>
Kiam sur la el&#349;uta pa&#285;o vi alklakas iun el tiuj nomoj, eventuale via
foliumilo demandas &#265;u vi volas startigi la dosieron a&#365; &#265;u vi volas
konservi &#285;in surdiske.  Respondu ke vi volas &#285;in surdiskigi kaj elektu
lokon por tio, ekzemple <code>c:\temp</code> a&#365; alian ekzistan dosierujon.
</p>
<p>
<h3>Elpreno</h3>
<p>
Klakklaku &#265;iun el la el&#349;utitaj dosieroj.  &#264;iufoje Vinzipo demandos, &#265;u
&#285;i maldensigu &#285;in en provizora dosierujo kaj malfermu.  Respondu jes.
Post sekundoj aperas vinzipa fenestro kun listo de la livera&#309;oj.
Alklaku la vinjeton <em>elprenu</em> (angle: <em>extract</em>) a&#365; la menueron
<em>komandoj-&gt;elprenu</em>.  Aperas dua fenestro nomata <em>elprenu</em> kun
diversaj indikoj.  Modifu nur la unuan indikon, kiu signas la lokon
por meti la revajn dosierojn.  Ekzemple vi povas entajpi <code>c:\revo</code>
(se &#285;i ne ekzistas jam, &#285;i krei&#285;os).  Alklaku la dekstran butonon
<em>elprenu</em>.  Dum momento Vinzipo elpakas la dosierojn de Revo.
</p>
<p>
La dosierujoj kaj dosieroj de Revo nun estas sur via durdisko, en
<code>c:\revo</code>.  Vi povas ilin esplori.
</p>
<a name="redaktu"></a>
<h2>4 - Redaktu</h2>
<p>
La foliumile konsulteblaj artikoloj de Revo trovi&#285;as en
<code>c:\revo\html</code>.  Ili utilos al vi nur por vidi la
artikolojn sen konekto al interreto.  La originalaj artikoloj de Revo,
kiujn vi priverkos, trovi&#285;as en <code>c:\revo\xml</code>.  Ili prezenti&#285;as kiel
tekstaj dosieroj kun sufikso <code>.xml</code>.  Ilin vi povas malfermi per
ordinara redaktilo (se vi klakklakas ilin, ili malfermi&#285;os tre
ver&#349;ajne en via kutima foliumilo, do vi prefere lan&#265;u redaktilon,
ekzemple Notepadon, kaj en &#285;i malfermu iun el la xml-dosieroj).  Vi
konstatos, ke la artikoloj entenas multajn markojn (ekzemple
&lt;rad&gt;...) kaj specialajn kodojn por iuj literoj (ekzemple
&amp;ccirc; anstata&#365; &#265;).  Tio necesas por Revo, sed neoportunas por
vi. Uniredo helpos pri tio.

</p>
<h3>Instalo kaj lingva agordo</h3>
<p>
De Uniredo instalu sinsekve la distribua&#309;on kaj la esperantan
asimilon.  Sur la labortablo klakklaku la vinjeton de Uniredo por &#285;in
startigi.  En la menuoj de Uniredo elektu
<em>Options-&gt;Language-&gt;Esperanto</em>.  Post tio &#265;iuj eroj de
Uniredo aperos en Esperanto.
</p>
<h3>Signara agordo</h3>
<p>
En la menuoj de Uniredo elektu <em>opcioj-&gt;dosieraj
agordoj-&gt;xml/xsl-&gt;signaroj</em>.  &#348;an&#285;u la valoron de 
<em>defa&#365;lta surogato</em> per <em>XML-Revo</em>.  Eliru el la
programo kaj relan&#265;u &#285;in.
</p>
<p>
Por provi, &#265;u &#265;io estas en ordo, vi kreu ie en via sistemo novan
tekstan dosieron kun fina&#309;o <code>.xml</code>, ekzemple
<code>efemer.xml</code>.  
Malfermu &#285;in per Uniredo.  Entajpu ekzemple: <code>&lt;ajn&gt;
ehxosxangxo... &lt;/ajn&gt;</code>.  Normale, la teksto aperas kun
kromsignaj literoj anstata&#365; la <em>x</em>-grupoj, do: <code>&lt;ajn&gt;
e&#293;o&#349;an&#285;o... &lt;/ajn&gt;</code>.  Konservu la dosieron.  Nun lan&#265;u
ordinaran redaktilon, ekzemple Notepadon, kaj malfermu per &#285;i
<code>efemer.xml</code>.  Normale vi vidas nun la supersignajn
literojn jene: <code>&lt;ajn&gt;
e&hcirc;o&scirc;an&gcirc;o... &lt;/ajn&gt;</code>.  Tiuj estas la kodoj
atenditaj de Revo.
</p>
<p>
Se &#265;io konformas al la &#309;usa klarigo, la afero glatas: vi tajpas
supersignajn literojn per klavo <code>x</code>, ili aperas en Uniredo kun
supersignoj, kaj ili konservi&#285;as la&#365; la revaj konvencioj.  (se iam vi
bezonos efektive la literserion <code>sx</code>, tajpu <code>s</code>
kaj dufoje <code>x</code>.)
</p>
<p>
Samo validas por la eventualaj kromsignaj literoj de via lingvo, kiujn
vi bezonos por traduki.  Tajpu ilin normale per via klavaro, kaj
kontrolu, ke ili aperas en alia redaktilo la&#365; la konvencioj de
<a href="../dtd/vokosgn.dtd">c:\revo\dtd\vokosgn.dtd</a>.  Ekzemple
<code>&#224;</code> devas aperi kiel <code>&amp;agrave;</code>.
</p>
<div class="noto">
  <p>Uniredo havas plurajn aliajn utilajn funkciojn.</p>
  <ol><li>Ekzemple en menuero <em>opcioj-&gt;subst.ini</em> vi trovos
  &#265;apitron [Revo].  En &#285;i vi povas aldoni mallongigojn, ekzemple:
  <blockquote class="noto">ekon* = &lt;uzo
  tip="fak"&gt;EKON&lt;/uzo&gt;</blockquote>
  kiam vi tajpos <code>ekon*</code> en redaktata artikolo, &#285;in
  anstata&#365;os la tuta litera&#309;o malanta&#365; la egal-signo.  Por funkciigi
  tion, en <em>opcioj-&gt;dosieraj agordoj-&gt;xml/xsl-&gt;klavaro</em>, sub
  <em>grupoj de anstata&#365;igoj</em> marku la fakon <em>Revo</em>.</li>
  <li>simile en menuero <em>opcioj-&gt;keys.ini</em> vi trovos &#265;apitron
  [XML-Revo].  En &#285;i vi povas aldoni stirklavajn komandojn, ekzemple,
  ke kiam vi klavas ALT+CTRL+E, Uniredo enskribas
  &lt;ekz&gt;&lt;/ekz&gt; kaj la kursoro revenas al la loko inter la
  du ekz-markoj...</li>
  </ol>
</div>
<a name="sendu"></a>
<h2>5 - Sendu viajn redakta&#309;ojn</h2>
<p>
Nun vi povas jam retu&#349;i artikolon de Revo per tradukoj a&#365; aliaj
aldonoj.  Por ilin facile sendi al Revo, prefere konservu ilin en
aparta dosierujo, ekzemple kreu por tio <code>c:\revo\pretas</code>.
</p>
<p>
Vi povus malfermi viajn redakta&#309;ojn per alia redaktilo ol Uniredo,
kopii la enhavon, &#285;in glui en mesa&#285;on, adresi la mesa&#285;on al
<code>revo@steloj.de</code>.  Tamen pli bone estus, se programo
a&#365;tomate kreus por &#265;iu artikolo mesa&#285;on kaj sendus &#285;in.  Blato helpos
pri tio.
</p>
<h3>Instalo kaj agordo</h3>
<p>
Se vi ne jam faris, el&#349;utu la version <em>lite</em> de Blato,
maldensigu la arkivon, kaj &#349;ovu <code>blat.exe</code> en dosierujon
<code>c:\winnt\system32</code> a&#365; <code>c:\windows\system32</code>
depende je via vindoza eldono.
</p>
<p>
En Vindozo, elektu
<em>startigi-&gt;programoj-&gt;helpiloj-&gt;komand-fenestro</em> por
malfermi DOS-stilan fenestron.  En tiu fenestro tajpu:
</p>
  <blockquote><code>blat</code></blockquote>
<p>
Se la respondo estas <code>blat lite vx.x...</code> kaj tiel plu, &#265;io
estas en ordo: <em>Blat</em> estas ruligebla.  Se la respondo estas 
<em>blat ne estas konata komando</em>, vi probable ne metis 
<code>blat.exe</code> en la &#285;ustan lokon por via sistemo.
</p>
<p>
Nun tajpu (ne la&#365;vorte!):
</p>
  <blockquote><code>blat -install <em>via-smtp-retaliro</em>
  <em>via@retadreso.ie</em></code></blockquote>
<p>
Tio estas nur ekzemplo.  Vi devas reale tajpi en la tria loko vian
veran SMTP-retaliron kaj en la kvara loko vian veran retadreson.  Se
vi ne scias kio estas via SMTP-retaliro, vi tamen povas trovi &#285;in en
via kutima mesa&#285;ilo, en la datumoj de via konto.  Kutime &#285;i aspektas
kiel <code><em>smtp.viaperanto.vialando</em></code>.  Ekzemple, se vi
lo&#285;as en Francio kaj uzas la interret-peranton 
<em>wanadoo</em>, &#285;i estas <code>smtp.wanadoo.fr</code>.
Anka&#365; la akcepta dokumento, kiun via peranto sendis, kutime entenas
tiun informon.
</p>
<p>
La komandon devas sekvi respondo kia 
<code>smtp server set to smtp.wanadoo.fr on port 25 with user vi@wanadoo.fr</code>.
</p>
<h3>Prova sendo</h3>
<p>
Nun Blato estas definitive instalita kaj agordita.  Vi povas provi per
&#285;i la sendon de dosieroj al Revo.  En la komand-fenestro &#349;angu al la
dosierujo <code>c:\revo\pretas</code> kie estas viaj redakta&#309;oj:
</p>
  <blockquote><code>cd c:\revo\pretas</code></blockquote>
<p>
Ni supozu, ke tien vi metis modifitan artikolon
<code>volpertingro.xml</code>.  Konekti&#285;u al Interreto, se tio ne jam
estas farita.  En la komand-fenestro tajpu:

</p>
  <blockquote><code>blat volpertingro.xml -to revo@steloj.de</code></blockquote>
<p>
(kompreneble por provo vi povas sendi unue al vi mem, metante vian
retadreson anstata&#365; <code>revo@steloj.de</code>.)  Se la sendado funkcias, vi vidas
respondon fini&#285;antan per <code>Sending
c:\revo\revo-02-pretas\volpertingro.xml to revo@steloj.de Login name
is via@retadreso</code>.
</p>
<h3>A&#365;tomata sendo</h3>
<p>
Vi ankora&#365; povas &#349;pari la penon tajpi tian komandon por &#265;iu preta
dosiero sendota al Revo. Simpla BAT-programeto prizorgos tion.
</p>
<p>
Kreu apud <code>c:\revo\pretas</code> alian dosierujon
<code>c:\revo\sendis</code>.  En <code>c:\revo\pretas</code> kreu
novan tekstan dosieron
<code>_blat-sendu.bat</code>, kaj malfermu &#285;in per redaktilo, ekzemple per
Notepado a&#365; Uniredo.
</p>
<p>
En vian programon metu la sekvan linion (&#285;i longas, sed &#285;i nepre restu unulinia):
</p>
  <blockquote><code>FOR %%f IN (c:\revo\pretas\*.xml) DO blat %%f -subject %%~nf -to revo@steloj.de -log _blat-sendu.log && move %%f c:\revo\sendis</code></blockquote>
<p>
Koncize klarigite, tiu programo prenos &#265;iun xml-dosieron en
<code>c:\revo\pretas</code>, uzos Blaton por sendi &#285;in al Revo, notos
la rezulton de la sendo en protokola dosiero <code>_blat-sendu.log</code> kaj se
la sendo sukcesis, movos la senditan dosieron al <code>c:\revo\sendis</code>.
</p>
<p>
Vi povas uzi tiun programon en DOS-stila komand-fenestro, irante al
&#285;ia dosierujo kaj tajpante &#285;ian nomon:
</p>
  <blockquote><code>cd c:\revo\pretas<br>_blat-sendu</code></blockquote>
<p>
Dum la unuaj provoj tio lasos al vi sufi&#265;an tempon por vidi la
respondojn de Blato.  Se &#265;io funkcias glate vi poste simple klakklaku
la programon en vindoza fenestro.  &#284;i mem malfermos komand-fenestron,
traktos la XML-dosierojn, kaj poste fermos la fenestron. 
</p>
<p>
&nbsp;
</p>
</body>
</html>


 


